<a href="https://colab.research.google.com/github/manjulamishra/DS-Code-Pandas_Useful_Functions/blob/master/Dealing_with_Duplicates.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Finding duplicates

https://thispointer.com/pandas-find-duplicate-rows-in-a-dataframe-based-on-all-or-selected-columns-using-dataframe-duplicated-in-python/

Most of the time it's important to know if the dataframe has duplicate entries.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
students = [('jack', 34, 'Sydeny'),
            ('Riti', 30, 'Delhi'),
            ('Aadi', 16, 'New York'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Mumbai'),
            ('Aadi', 40, 'London'),
            ('Sachin', 30, 'Delhi')
            ]
 
# Create a DataFrame object
df = pd.DataFrame(students, columns=['Name', 'Age', 'City'])

In [ ]:
df

     Name  Age      City
0    jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
3    Riti   30     Delhi
4    Riti   30     Delhi
5    Riti   30    Mumbai
6    Aadi   40    London
7  Sachin   30     Delhi

**Assigning duplcates into a new variable**

by default, the first occurance is make as not duplicate or True and any occrance later is marked as a duplicate entry. 

The duplicate entries can be found on all columns or just a few. For example just names can be duplicates or two column entries might have duplicate values or sometimes the entire rows might be exact duplicates.

In [ ]:
# this show the duplicate observation
# by default the parameter keep='first'
#  that means it marks the first row as True or not duplicate 
df_dup = df[df.duplicated()]

In [ ]:
df_dup

   Name  Age   City
3  Riti   30  Delhi
4  Riti   30  Delhi

**Making a decision to keep one entry either the first one on last one**

In [ ]:
# in this case, the last observation is marked as True while the first two occurances are duplicates
# it's considering all columns
df_no_duplicates = df[df.duplicated(keep='last')]

In [ ]:
df_no_duplicates

   Name  Age   City
1  Riti   30  Delhi
3  Riti   30  Delhi

## finding Duplicates on select Columns

In [ ]:
df_select_columns = df[df.duplicated(['Name'])]

In [ ]:
df_select_columns

   Name  Age    City
3  Riti   30   Delhi
4  Riti   30   Delhi
5  Riti   30  Mumbai
6  Aadi   40  London